#!/usr/local/bin/python
# -*- coding: utf-8 -*-
import os, sys

file = r"""Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Πρόθεμα κέντρου	Περιοχές (ενδεικτικά)
2102x	Βόρειο Τμήμα Κεντρικού Τομέα Αθηνών, Αχαρνές, Άνω Λιόσια & Φυλή
21020	ΑΛΥΣΙΔΑ, ΑΝΩ ΠΑΤΗΣΙΑ, ΓΑΛΑΤΣΙ, ΚΑΤΩ ΠΑΤΗΣΙΑ, ΛΑΜΠΡΙΝΗ, ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ, ΠΑΤΗΣΙΑ, ΠΕΡΙΣΣΟΣ, ΠΛΑΤΕΙΑ ΚΟΛΙΑΤΣΟΥ, ΡΙΖΟΥΠΟΛΗ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ
21021	ΝΕΑ ΧΑΛΚΗΔΟΝΑ, ΑΛΥΣΙΔΑ, ΑΝΩ ΠΑΤΗΣΙΑ, ΓΑΛΑΤΣΙ, ΛΑΜΠΡΙΝΗ, ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ, ΠΑΤΗΣΙΑ, ΠΕΡΙΣΣΟΣ, ΡΙΖΟΥΠΟΛΗ
21022	ΓΑΛΑΤΣΙ, ΛΑΜΠΡΙΝΗ, ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ, ΠΑΤΗΣΙΑ, ΠΕΡΙΣΣΟΣ, ΡΙΖΟΥΠΟΛΗ, ΚΑΤΩ ΠΑΤΗΣΙΑ, ΠΛΑΤΕΙΑ ΚΟΛΙΑΤΣΟΥ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ, ΑΛΥΣΙΔΑ, ΑΝΩ ΠΑΤΗΣΙΑ
21023	ΑΓΙΟΙ ΑΝΑΡΓΥΡΟΙ, ΑΧΑΡΝΕΣ, ΖΕΦΥΡΙ, ΖΟΦΡΙΑ, ΚΑΜΑΤΕΡΟ, ΜΥΚΟΝΙΑΤΙΚΑ, ΝΕΑ ΛΙΟΣΙΑ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ, ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ, ΠΑΤΗΣΙΑ
21024	ΑΜΥΓΔΑΛΕΖΑ, ΑΝΩ ΛΙΟΣΙΑ, ΘΡΑΚΟΜΑΚΕΔΟΝΕΣ, ΠΑΡΝΗΘΑ, ΤΑΤΟΙ, ΦΥΛΗ, ΧΑΣΙΑ, ΑΧΑΡΝΕΣ, ΖΕΦΥΡΙ, ΖΟΦΡΙΑ, ΚΑΜΑΤΕΡΟ, ΝΕΑ ΛΙΟΣΙΑ, ΛΑΜΠΡΙΝΗ
21025	ΝΕΑ ΙΩΝΙΑ, ΜΥΚΟΝΙΑΤΙΚΑ, ΝΕΑ ΧΑΛΚΗΔΩΝΑ, ΑΝΩ ΠΑΤΗΣΙΑ, ΠΕΡΙΣΣΟΣ, ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ, ΡΙΖΟΥΠΟΛΗ, ΛΑΜΠΡΙΝΗ, ΠΑΤΗΣΙΑ
21026	ΚΑΜΑΤΕΡΟ, ΑΧΑΡΝΕΣ, ΜΥΚΟΝΙΑΤΙΚΑ, ΝΕΑ ΛΙΟΣΙΑ, ΝΕΑ ΧΑΛΚΗΔΩΝΑ, ΜΠΟΥΡΝΑΖΙ, ΠΕΤΡΟΥΠΟΛΗ, ΑΓΙΟΙ ΑΝΑΡΓΥΡΟΙ, ΑΝΩ ΛΙΟΣΙΑ, ΖΕΦΥΡΙ, ΖΟΦΡΙΑ
21027	ΑΛΣΟΥΠΟΛΗ, ΑΜΑΡΟΥΣΙΟΝ, ΗΡΑΚΛΕΙΟ, ΚΑΛΟΓΡΕΖΑ, ΛΥΚΟΒΡΥΣΗ, ΜΑΓΚΟΥΦΑΝΑ, ΜΕΤΑΜΟΡΦΩΣΗ, ΠΕΥΚΗ, ΦΙΛΟΘΕΗ, ΝΕΑ ΙΩΝΙΑ, ΓΑΛΑΤΣΙ, ΝΕΑ ΧΑΛΚΗΔΩΝΑ, ΠΕΡΙΣΣΟΣ, ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ, ΡΙΖΟΥΠΟΛΗ, ΛΑΜΠΡΙΝΗ
21028	ΗΡΑΚΛΕΙΟ, ΚΑΛΟΓΡΕΖΑ, ΛΥΚΟΒΡΥΣΗ, ΜΑΓΚΟΥΦΑΝΑ, ΜΕΤΑΜΟΡΦΩΣΗ, ΠΕΥΚΗ, ΝΕΑ ΙΩΝΙΑ
21029	ΚΥΨΕΛΗ, ΝΕΑ ΙΩΝΙΑ, ΑΝΩ ΠΑΤΗΣΙΑ, ΓΑΛΑΤΣΙ, ΝΕΑ ΧΑΛΚΗΔΩΝΑ, ΠΕΡΙΣΣΟΣ, ΡΙΖΟΥΠΟΛΗ, ΛΑΜΠΡΙΝΗ, ΠΑΤΗΣΙΑ
2103x	Κέντρο Αθηνών & Διεθνής Αερολιμένας Αθηνών «Ελευθέριος Βενιζέλος»
21032	ΑΘΗΝΑΣ, ΑΚΡΟΠΟΛΗ, ΒΟΤΑΝΙΚΟΣ, ΓΚΑΖΙ, ΘΗΣΕΙΟ, ΚΕΝΤΡΟ, ΚΡΑΤΙΝΟΥ, ΜΑΚΡΥΓΙΑΝΝΗ, ΜΕΤΑΞΟΥΡΓΕΙΟ, ΜΟΝΑΣΤΗΡΑΚΙ, ΟΜΟΝΟΙΑ, ΠΕΤΡΑΛΩΝΑ, ΠΛΑΚΑ, ΣΤΑΔΙΟΝ, ΣΥΝΤΑΓΜΑ, ΦΙΛΟΠΑΠΠΟΥ, ΚΟΥΚΑΚΙ, ΝΕΟΣ ΚΟΣΜΟΣ
21033	ΑΚΑΔΗΜΙΑΣ, ΓΚΥΖΗ, ΕΞΑΡΧΕΙΑ, ΚΟΛΩΝΑΚΙ, ΜΟΥΣΕΙΟ, ΝΕΑΠΟΛΗ, ΣΟΛΩΝΟΣ, ΚΕΝΤΡΟ, ΟΜΟΝΟΙΑ, ΣΥΝΤΑΓΜΑ
21034	ΑΙΓΑΛΕΩ, ΚΑΛΛΙΘΕΑ, ΚΕΡΑΜΕΙΚΟΣ, ΡΕΝΤΗΣ, ΡΟΥΦ, ΤΑΥΡΟΣ, ΑΘΗΝΑΣ, ΒΟΤΑΝΙΚΟΣ, ΓΚΑΖΙ, ΘΗΣΕΙΟ, ΜΕΤΑΞΟΥΡΓΕΙΟ, ΜΟΝΑΣΤΗΡΑΚΙ, ΠΕΤΡΑΛΩΝΑ, ΠΛΑΚΑ, ΦΙΛΟΠΑΠΠΟΥ
21035	ΑΕΡΟΔΡΟΜΙΟ ΣΠΑΤΩΝ
21036	ΑΚΑΔΗΜΙΑΣ, ΓΚΥΖΗ, ΕΞΑΡΧΕΙΑ, ΚΟΛΩΝΑΚΙ, ΜΟΥΣΕΙΟ, ΝΕΑΠΟΛΗ, ΣΟΛΩΝΟΣ, ΚΕΝΤΡΟ, ΟΜΟΝΟΙΑ, ΣΥΝΤΑΓΜΑ
2104x	Πειραιάς & Σαλαμίνα
21040	ΚΕΡΑΤΣΙΝΙ, ΚΟΚΚΙΝΙΑ, ΝΙΚΑΙΑ, ΠΕΙΡΑΙΑΣ, ΠΕΡΑΜΑ, ΡΕΝΤΗΣ
21041	ΛΙΜΑΝΙ ΠΕΙΡΑΙΑ, ΜΟΣΧΑΤΟ, ΝΕΟ ΦΑΛΗΡΟ, ΦΡΕΑΤΙΔΑ, ΠΕΙΡΑΙΑΣ, ΡΕΝΤΗΣ
21042	ΚΑΛΛΙΠΟΛΗ, ΛΙΜΑΝΙ ΠΕΙΡΑΙΑ, ΜΟΣΧΑΤΟ, ΝΕΟ ΦΑΛΗΡΟ, ΦΡΕΑΤΙΔΑ, ΠΕΙΡΑΙΑΣ, ΡΕΝΤΗΣ
21043	ΑΓΙΟΣ ΓΕΩΡΓΙΟΣ ΚΕΡΑΤΣ., ΑΜΦΙΑΛΗ, ΔΡΑΠΕΤΣΩΝΑ, ΚΕΡΑΤΣΙΝΙ, ΚΟΚΚΙΝΙΑ, ΠΕΡΑΜΑ, ΠΕΙΡΑΙΑΣ
21044	ΠΕΡΑΜΑ
21045	ΚΑΛΛΙΠΟΛΗ, ΛΙΜΑΝΙ ΠΕΙΡΑΙΑ, ΜΟΣΧΑΤΟ, ΦΡΕΑΤΙΔΑ, ΠΕΙΡΑΙΑΣ, ΡΕΝΤΗΣ
21046	ΚΟΚΚΙΝΙΑ, ΠΕΙΡΑΙΑΣ, ΣΑΛΑΜΙΝΑ, ΑΓΙΟΣ ΓΕΩΡΓΙΟΣ ΚΕΡΑΤΣ., ΑΜΦΙΑΛΗ, ΔΡΑΠΕΤΣΩΝΑ, ΚΕΡΑΤΣΙΝΙ
21048	ΡΟΥΦ, ΤΑΥΡΟΣ, ΝΕΟ ΦΑΛΗΡΟ, ΜΟΣΧΑΤΟ, ΠΕΙΡΑΙΑΣ, ΡΕΝΤΗΣ
21049	ΑΓΙΑ ΒΑΡΒΑΡΑ, ΑΝΩ ΚΟΡΥΔΑΛΟΣ, ΚΟΡΥΔΑΛΛΟΣ, ΝΙΚΑΙΑ, ΑΜΦΙΑΛΗ, ΚΕΡΑΤΣΙΝΙ, ΚΟΚΚΙΝΙΑ, ΡΕΝΤΗΣ
2105x	Δυτικό Τμήμα Κεντρικού Τομέα Αθηνών, Δυτικά Προάστια Αθηνών, Ασπρόπυργος, Ελευσίνα & Μάνδρα
21050	ΑΝΘΟΥΠΟΛΗ, ΠΕΡΙΣΤΕΡΙ, ΜΠΟΥΡΝΑΖΙ, ΠΕΤΡΟΥΠΟΛΗ, ΝΕΑ ΛΙΟΣΙΑ
21051	ΚΟΛΟΚΥΝΘΟΥ, ΚΟΛΩΝΟΣ, ΛΟΦΟΣ ΣΚΟΥΖΕ, ΠΛΑΤΕΙΑ ΑΤΤΙΚΗΣ, ΣΕΠΟΛΙΑ, ΣΤΑΘΜΟΣ ΛΑΡΙΣΣΗΣ, ΜΕΤΑΞΟΥΡΓΕΙΟ, ΡΟΥΦ
21052	ΠΕΔΙΟΝ ΑΡΕΩΣ, ΚΑΡΟΛΟΥ, ΠΛΑΤΕΙΑ ΒΑΘΗΣ, ΚΕΡΑΜΕΙΚΟΣ, ΚΟΛΟΚΥΝΘΟΥ, ΚΟΛΩΝΟΣ, ΛΟΦΟΣ ΣΚΟΥΖΕ, ΟΜΟΝΟΙΑ, ΡΟΥΦ, ΣΤΑΘΜΟΣ ΛΑΡΙΣΣΗΣ, ΒΟΤΑΝΙΚΟΣ, ΓΚΑΖΙ, ΜΟΥΣΕΙΟ, ΚΕΝΤΡΟ, ΜΕΤΑΞΟΥΡΓΕΙΟ
21053	ΑΓΙΑ ΒΑΡΒΑΡΑ, ΑΙΓΑΛΕΩ, ΑΝΘΟΥΠΟΛΗ, ΑΝΩ ΚΟΡΥΔΑΛΟΣ, ΚΟΡΥΔΑΛΛΟΣ, ΠΕΡΙΣΤΕΡΙ, ΑΣΠΡΟΠΥΡΓΟΣ, ΕΛΕΥΣΙΝΑ, ΛΟΦΟΣ ΑΞΙΩΜΑΤΙΚΩΝ, ΜΑΓΟΥΛΑ, ΜΑΝΔΡΑ, ΧΑΙΔΑΡΙ, ΣΕΠΟΛΙΑ, ΣΚΑΡΑΜΑΓΚΑΣ, ΚΟΛΟΚΥΝΘΟΥ, ΜΠΟΥΡΝΑΖΙ
21054	ΧΑΙΔΑΡΙ, ΑΓΙΑ ΒΑΡΒΑΡΑ, ΑΙΓΑΛΕΩ, ΑΝΩ ΚΟΡΥΔΑΛΟΣ, ΚΟΡΥΔΑΛΛΟΣ
21055	ΣΚΑΡΑΜΑΓΚΑΣ, ΑΣΠΡΟΠΥΡΓΟΣ, ΕΛΕΥΣΙΝΑ, ΜΑΓΟΥΛΑ, ΜΑΝΔΡΑ, ΧΑΙΔΑΡΙ
21056	ΚΟΡΥΔΑΛΛΟΣ, ΑΝΩ ΚΟΡΥΔΑΛΟΣ, ΑΓΙΑ ΒΑΡΒΑΡΑ, ΑΙΓΑΛΕΩ, ΧΑΙΔΑΡΙ
21057	ΚΟΛΟΚΥΝΘΟΥ, ΖΟΦΡΙΑ, ΜΠΟΥΡΝΑΖΙ, ΝΕΑ ΛΙΟΣΙΑ, ΧΑΙΔΑΡΙ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ, ΛΟΦΟΣ ΑΞΙΩΜΑΤΙΚΩΝ, ΑΝΘΟΥΠΟΛΗ, ΚΟΛΩΝΟΣ, ΠΕΡΙΣΤΕΡΙ, ΠΕΤΡΟΥΠΟΛΗ, ΣΕΠΟΛΙΑ
21058	ΠΕΡΙΣΤΕΡΙ, ΑΓΙΑ ΒΑΡΒΑΡΑ, ΑΙΓΑΛΕΩ, ΧΑΙΔΑΡΙ
21059	ΛΟΦΟΣ ΑΞΙΩΜΑΤΙΚΩΝ, ΡΟΥΦ, ΑΝΩ ΚΟΡΥΔΑΛΟΣ, ΠΕΡΙΣΤΕΡΙ, ΑΓΙΑ ΒΑΡΒΑΡΑ, ΑΙΓΑΛΕΩ, ΧΑΙΔΑΡΙ, ΡΕΝΤΗΣ
2106x	Βορειοανατολικό Τμήμα Κεντρικού Τομέα Αθηνών, Βόρεια Προάστια Αθηνών, Παλλήνη & Κορωπί
21060	ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ, ΒΡΙΛΗΣΙΑ, ΓΑΡΓΗΤΟΣ, ΓΕΡΑΚΑΣ, ΓΛΥΚΑ ΝΕΡΑ, ΚΟΡΩΠΙ, ΠΑΙΑΝΙΑ, ΠΑΛΛΗΝΗ, ΠΙΚΕΡΜΙ, ΣΤΑΥΡΟΣ, ΧΑΛΑΝΔΡΙ, ΧΟΛΑΡΓΟΣ
21061	ΜΑΡΟΥΣΙ, ΜΕΛΙΣΣΙΑ, ΠΕΝΤΕΛΗ, ΑΜΑΡΟΥΣΙΟΝ, ΒΡΙΛΗΣΙΑ
21062	ΑΜΑΡΟΥΣΙΟΝ, ΑΧΑΡΝΕΣ, ΒΡΙΛΗΣΙΑ, ΗΡΑΚΛΕΙΟ, ΛΥΚΟΒΡΥΣΗ, ΜΑΓΚΟΥΦΑΝΑ, ΠΕΥΚΗ, ΑΝΟΙΞΙΣ, ΔΙΟΝΥΣΟΣ, ΔΡΟΣΙΑ, ΕΚΑΛΗ, ΚΑΣΤΡΙ, ΚΗΦΙΣΣΙΑ, ΚΡΥΟΝΕΡΙ, ΜΠΑΛΛΑ, ΜΠΟΓΙΑΤΙ, ΝΕΑ ΕΡΥΘΡΑΙΑ, ΡΕΑ, ΣΤΑΜΑΤΑ, ΜΑΡΟΥΣΙ, ΠΕΝΤΕΛΗ, ΤΑΤΟΙ, ΑΓΙΟΣ ΣΤΕΦΑΝΟΣ
21063	ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ, ΣΤΑΥΡΟΣ, ΧΟΛΑΡΓΟΣ, ΒΡΙΛΗΣΙΑ
21064	ΑΛΕΞΑΝΔΡΑΣ, ΑΜΠΕΛΟΚΗΠΟΙ, ΓΗΡΟΚΟΜΕΙΟ, ΓΟΥΔΙ, ΕΛΛΗΝΟΡΩΣΩΝ, ΕΡΥΘΡΟΣ ΣΤΑΥΡΟΣ, ΕΞΑΡΧΕΙΑ, ΚΟΛΩΝΑΚΙ, ΝΕΑΠΟΛΗ, ΖΩΓΡΑΦΟΥ, ΝΕΟ ΨΥΧΙΚΟ, ΠΟΛΥΓΩΝΟ, ΨΥΧΙΚΟ, ΚΥΨΕΛΗ, ΦΙΛΟΘΕΗ, ΧΑΛΑΝΔΡΙ, ΓΚΥΖΗ
21065	ΠΑΠΑΓΟΥ, ΠΟΛΥΔΡΟΣΟ, ΝΕΟ ΨΥΧΙΚΟ, ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ, ΧΑΛΑΝΔΡΙ, ΧΟΛΑΡΓΟΣ
21066	ΑΝΘΟΥΣΑ, ΛΕΟΝΤΑΡΙΟΝ, ΛΙΟΠΕΣΙ, ΝΤΑΟΥ ΠΕΝΤΕΛΗΣ, ΣΠΑΤΑ, ΓΑΡΓΗΤΟΣ, ΓΕΡΑΚΑΣ, ΓΛΥΚΑ ΝΕΡΑ, ΚΟΡΩΠΙ, ΠΑΙΑΝΙΑ, ΠΑΛΛΗΝΗ, ΠΙΚΕΡΜΙ, ΣΤΑΥΡΟΣ
21067	ΓΗΡΟΚΟΜΕΙΟ, ΕΛΛΗΝΟΡΩΣΩΝ, ΠΑΠΑΓΟΥ, ΠΟΛΥΔΡΟΣΟ, ΨΥΧΙΚΟ, ΝΕΟ ΨΥΧΙΚΟ, ΦΙΛΟΘΕΗ, ΧΑΛΑΝΔΡΙ, ΧΟΛΑΡΓΟΣ
21068	ΑΛΣΟΥΠΟΛΗ, ΜΕΛΙΣΣΙΑ, ΜΑΡΟΥΣΙ, ΠΟΛΥΔΡΟΣΟ, ΨΥΧΙΚΟ, ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ, ΦΙΛΟΘΕΗ, ΑΜΑΡΟΥΣΙΟΝ, ΧΑΛΑΝΔΡΙ, ΧΟΛΑΡΓΟΣ, ΒΡΙΛΗΣΙΑ
21069	ΑΜΠΕΛΟΚΗΠΟΙ, ΕΡΥΘΡΟΣ ΣΤΑΥΡΟΣ, ΓΗΡΟΚΟΜΕΙΟ, ΕΛΛΗΝΟΡΩΣΩΝ, ΝΕΟ ΨΥΧΙΚΟ, ΨΥΧΙΚΟ, ΦΙΛΟΘΕΗ
2107x	Ανατολικό τμήμα Κεντρικού Τομέα Αθηνών
21070	ΚΑΙΣΑΡΙΑΝΗ, ΝΕΑ ΕΛΒΕΤΙΑ, ΠΑΓΚΡΑΤΙ, ΥΜΗΤΤΟΣ, ΖΩΓΡΑΦΟΥ, ΑΓΙΟΣ ΑΡΤΕΜΙΟΣ
21072	ΑΓΙΟΣ ΑΡΤΕΜΙΟΣ, ΒΥΡΩΝΑΣ, ΗΛΥΣΙΑ, ΙΛΙΣΣΙΑ, ΓΟΥΔΙ, ΚΑΙΣΑΡΙΑΝΗ, ΠΑΓΚΡΑΤΙ, ΣΤΑΔΙΟΝ, ΚΟΛΩΝΑΚΙ
21074	ΑΜΠΕΛΟΚΗΠΟΙ
21075	ΑΓΙΟΣ ΑΡΤΕΜΙΟΣ, ΚΑΡΕΑΣ, ΒΥΡΩΝΑΣ, ΝΕΑ ΕΛΒΕΤΙΑ, ΥΜΗΤΤΟΣ, ΖΩΓΡΑΦΟΥ, ΚΑΙΣΑΡΙΑΝΗ, ΠΑΓΚΡΑΤΙ
21076	ΗΛΙΟΥΠΟΛΗ, ΑΓΙΟΣ ΑΡΤΕΜΙΟΣ, ΚΑΡΕΑΣ, ΒΥΡΩΝΑΣ, ΝΕΑ ΕΛΒΕΤΙΑ, ΥΜΗΤΤΟΣ, ΖΩΓΡΑΦΟΥ, ΚΑΙΣΑΡΙΑΝΗ, ΠΑΓΚΡΑΤΙ
21077	ΗΛΥΣΙΑ, ΙΛΙΣΣΙΑ, ΓΟΥΔΙ, ΕΡΥΘΡΟΣ ΣΤΑΥΡΟΣ, ΠΑΠΑΓΟΥ, ΑΜΠΕΛΟΚΗΠΟΙ, ΖΩΓΡΑΦΟΥ, ΚΑΙΣΑΡΙΑΝΗ
2108x	Βόρεια Προάστια Αθηνών, Βορειοδυτικό τμήμα Κεντρικού Τομέα Αθηνών, Νότιο τμήμα Νοτίων Προαστίων Αθηνών & Βάρη
21080	ΑΓΙΟΣ ΣΤΕΦΑΝΟΣ, ΑΝΟΙΞΙΣ, ΚΑΣΤΡΙ, ΚΗΦΙΣΣΙΑ, ΚΡΥΟΝΕΡΙ, ΜΠΑΛΛΑ, ΜΠΟΓΙΑΤΙ, ΜΑΡΟΥΣΙ, ΠΕΥΚΗ, ΜΑΓΚΟΥΦΑΝΑ, ΖΟΦΡΙΑ, ΑΜΑΡΟΥΣΙΟΝ, ΒΡΙΛΗΣΙΑ, ΝΕΑ ΕΡΥΘΡΑΙΑ, ΡΕΑ, ΣΤΑΜΑΤΑ, ΜΕΛΙΣΣΙΑ, ΠΕΝΤΕΛΗ, ΤΑΤΟΙ, ΗΡΑΚΛΕΙΟ, ΛΥΚΟΒΡΥΣΗ
21081	ΑΓΙΟΣ ΣΤΕΦΑΝΟΣ, ΔΙΟΝΥΣΟΣ, ΔΡΟΣΙΑ, ΕΚΑΛΗ, ΑΝΟΙΞΙΣ, ΚΑΣΤΡΙ, ΚΗΦΙΣΣΙΑ, ΚΡΥΟΝΕΡΙ, ΜΠΑΛΛΑ, ΜΠΟΓΙΑΤΙ, ΝΕΑ ΕΡΥΘΡΑΙΑ, ΡΕΑ, ΣΤΑΜΑΤΑ, ΠΕΝΤΕΛΗ, ΜΑΓΚΟΥΦΑΝΑ
21082	ΑΓΓΕΛΟΠΟΥΛΟΥ, ΑΓΙΟΣ ΠΑΝΤΕΛΕΗΜΩΝ, ΠΛΑΤΕΙΑ ΑΜΕΡΙΚΗΣ, ΠΛΑΤΕΙΑ ΒΙΚΤΩΡΙΑΣ, ΠΕΔΙΟΝ ΑΡΕΩΣ, ΠΛΑΤΕΙΑ ΑΤΤΙΚΗΣ, ΠΛΑΤΕΙΑ ΒΑΘΗΣ, ΠΟΛΥΓΩΝΟ, ΚΥΨΕΛΗ, ΠΛΑΤΕΙΑ ΚΟΛΙΑΤΣΟΥ, ΣΤΑΘΜΟΣ ΛΑΡΙΣΣΗΣ, ΓΚΥΖΗ, ΕΞΑΡΧΕΙΑ, ΜΟΥΣΕΙΟ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ, ΠΑΤΗΣΙΑ
21083	ΔΑΓΚΛΗ, ΑΓΙΟΙ ΑΝΑΡΓΥΡΟΙ, ΚΑΤΩ ΠΑΤΗΣΙΑ, ΛΟΦΟΣ ΣΚΟΥΖΕ, ΠΛΑΤΕΙΑ ΑΤΤΙΚΗΣ, ΜΥΚΟΝΙΑΤΙΚΑ, ΣΕΠΟΛΙΑ, ΣΤΑΘΜΟΣ ΛΑΡΙΣΣΗΣ, ΜΠΟΥΡΝΑΖΙ, ΝΕΑ ΧΑΛΚΗΔΩΝΑ, ΝΕΑ ΛΙΟΣΙΑ, ΡΙΖΟΥΠΟΛΗ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ, ΠΑΤΗΣΙΑ
21085	ΚΥΨΕΛΗ
21086	ΑΓΓΕΛΟΠΟΥΛΟΥ, ΑΓΙΟΣ ΠΑΝΤΕΛΕΗΜΩΝ, ΠΛΑΤΕΙΑ ΑΜΕΡΙΚΗΣ, ΠΛΑΤΕΙΑ ΒΙΚΤΩΡΙΑΣ, ΠΕΔΙΟΝ ΑΡΕΩΣ, ΠΟΛΥΓΩΝΟ, ΚΑΤΩ ΠΑΤΗΣΙΑ, ΠΛΑΤΕΙΑ ΚΟΛΙΑΤΣΟΥ, ΣΤΑΘΜΟΣ ΛΑΡΙΣΣΗΣ, ΜΟΥΣΕΙΟ, ΚΥΨΕΛΗ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ, ΠΑΤΗΣΙΑ
21088	ΑΛΕΞΑΝΔΡΑΣ, ΑΓΓΕΛΟΠΟΥΛΟΥ, ΑΓΙΟΣ ΠΑΝΤΕΛΕΗΜΩΝ, ΠΛΑΤΕΙΑ ΑΜΕΡΙΚΗΣ, ΠΛΑΤΕΙΑ ΒΑΘΗΣ, ΠΛΑΤΕΙΑ ΒΙΚΤΩΡΙΑΣ, ΠΕΔΙΟΝ ΑΡΕΩΣ, ΠΛΑΤΕΙΑ ΑΤΤΙΚΗΣ, ΠΟΛΥΓΩΝΟ, ΓΚΥΖΗ, ΕΞΑΡΧΕΙΑ, ΠΛΑΤΕΙΑ ΚΟΛΙΑΤΣΟΥ, ΜΟΥΣΕΙΟ, ΚΥΨΕΛΗ, ΤΡΕΙΣ ΓΕΦΥΡΕΣ, ΠΑΤΗΣΙΑ
21089	ΒΑΡΗ, ΒΑΡΚΙΖΑ, ΒΟΥΛΑ, ΒΟΥΛΙΑΓΜΕΝΗ, ΓΛΥΦΑΔΑ, ΕΛΛΗΝΙΚΟ, ΚΑΒΟΥΡΙ, ΣΟΥΡΜΕΝΑ, ΤΕΡΨΙΘΕΑ, ΤΡΑΧΩΝΕΣ
2109x	Νότιο Τμήμα Κεντρικού Τομέα Αθηνών, Νότια Προάστια Αθηνών & Βάρη
21090	ΑΓΙΟΣ ΣΩΣΤΗΣ, ΔΑΦΝΗ, ΚΟΥΚΑΚΙ, ΝΕΑ ΣΜΥΡΝΗ, ΝΕΟΣ ΚΟΣΜΟΣ, ΑΚΡΟΠΟΛΗ, ΚΑΛΛΙΘΕΑ, ΜΑΚΡΥΓΙΑΝΝΗ, ΦΙΛΟΠΑΠΠΟΥ, ΝΕΑ ΕΛΒΕΤΙΑ, ΥΜΗΤΤΟΣ, ΑΓΙΟΣ ΑΡΤΕΜΙΟΣ, ΠΑΓΚΡΑΤΙ
21092	ΑΓΙΟΣ ΣΩΣΤΗΣ, ΔΑΦΝΗ, ΗΛΙΟΥΠΟΛΗ, ΚΟΥΚΑΚΙ, ΝΕΑ ΣΜΥΡΝΗ, ΝΕΟΣ ΚΟΣΜΟΣ, ΑΚΡΟΠΟΛΗ, ΘΗΣΕΙΟ, ΚΑΛΛΙΘΕΑ, ΜΑΚΡΥΓΙΑΝΝΗ, ΜΟΝΑΣΤΗΡΑΚΙ, ΠΕΤΡΑΛΩΝΑ, ΠΛΑΚΑ, ΣΤΑΔΙΟΝ, ΤΑΥΡΟΣ, ΦΙΛΟΠΑΠΠΟΥ, ΠΑΓΚΡΑΤΙ
21093	ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ, ΙΠΠΟΔΡΟΜΟΣ, ΚΑΛΑΜΑΚΙ, ΜΠΡΑΧΑΜΙ, ΠΑΛΑΙΟ ΦΑΛΗΡΟ, ΑΓΙΟΣ ΣΩΣΤΗΣ, ΝΕΑ ΣΜΥΡΝΗ, ΝΕΟΣ ΚΟΣΜΟΣ, ΑΛΙΜΟΣ, ΚΑΛΛΙΘΕΑ, ΜΟΣΧΑΤΟ
21094	ΑΜΦΙΘΕΑ, ΤΖΙΤΖΙΦΙΕΣ, ΙΠΠΟΔΡΟΜΟΣ, ΠΑΛΑΙΟ ΦΑΛΗΡΟ, ΤΑΥΡΟΣ, ΚΑΛΛΙΘΕΑ, ΜΟΣΧΑΤΟ. ΝΕΑ ΣΜΥΡΝΗ
21095	ΑΜΦΙΘΕΑ, ΤΖΙΤΖΙΦΙΕΣ, ΙΠΠΟΔΡΟΜΟΣ, ΚΟΥΚΑΚΙ, ΑΓΙΟΣ ΣΩΣΤΗΣ, ΝΕΟΣ ΚΟΣΜΟΣ, ΤΑΥΡΟΣ, ΚΑΛΛΙΘΕΑ, ΝΕΑ ΣΜΥΡΝΗ
21096	ΑΕΡΟΔΡΟΜΙΟ (ΕΛΛΗΝΙΚΟΥ), ΑΡΓΥΡΟΥΠΟΛΗ, ΒΑΡΚΙΖΑ, ΒΟΥΛΑ, ΓΛΥΦΑΔΑ, ΕΛΛΗΝΙΚΟ, ΣΟΥΡΜΕΝΑ, ΤΕΡΨΙΘΕΑ, ΤΡΑΧΩΝΕΣ
21097	ΑΛΙΜΟΣ, ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ, ΑΡΓΥΡΟΥΠΟΛΗ, ΚΑΛΑΜΑΚΙ, ΜΠΡΑΧΑΜΙ, ΔΑΦΝΗ, ΕΛΛΗΝΙΚΟ, ΗΛΙΟΥΠΟΛΗ, ΚΑΡΕΑΣ, ΣΟΥΡΜΕΝΑ, ΤΕΡΨΙΘΕΑ, ΤΡΑΧΩΝΕΣ, ΝΕΑ ΕΛΒΕΤΙΑ, ΥΜΗΤΤΟΣ, ΝΕΑ ΣΜΥΡΝΗ
21098	ΑΕΡΟΔΡΟΜΙΟ (ΕΛΛΗΝΙΚΟΥ), ΑΛΙΜΟΣ, ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ, ΑΜΦΙΘΕΑ, ΑΡΓΥΡΟΥΠΟΛΗ, ΚΑΛΑΜΑΚΙ, ΜΠΡΑΧΑΜΙ, ΠΑΛΑΙΟ ΦΑΛΗΡΟ, ΤΖΙΤΖΙΦΙΕΣ, ΕΛΛΗΝΙΚΟ, ΣΟΥΡΜΕΝΑ, ΤΕΡΨΙΘΕΑ, ΤΡΑΧΩΝΕΣ, ΝΕΑ ΣΜΥΡΝΗ
21099	ΑΛΙΜΟΣ, ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ, ΑΜΦΙΘΕΑ, ΑΡΓΥΡΟΥΠΟΛΗ, ΔΑΦΝΗ, ΗΛΙΟΥΠΟΛΗ, ΚΑΛΑΜΑΚΙ, ΚΑΡΕΑΣ, ΜΠΡΑΧΑΜΙ, ΕΛΛΗΝΙΚΟ, ΣΟΥΡΜΕΝΑ, ΤΕΡΨΙΘΕΑ, ΤΡΑΧΩΝΕΣ
Ζώνη 22 – Περιοχή Ανατολικής Στερεάς Ελλάδας και Νήσων
Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Περιοχές (ενδεικτικά)
222x	Εύβοια
2221	Χαλκίδα	Χαλκίδα
2222	Κύμη & Σκύρος	Κύμη, Σκύρος
2223	Αλιβέρι	Αλιβέρι
2224	Κάρυστος	Κάρυστος, Στύρα
2226	Αιδηψός	Αιδηψός
2227	Μαντούδι	Μαντούδι
2228	Ψαχνά	Ψαχνά
2229	Ερέτρια	Ερέτρια
223x	Ευρυτανία & Φθιώτιδα	
2231	Λαμία	Λαμία
2232	Δομοκός	Δομοκός
2233	Αταλάντη	Αταλάντη
2234	Αμφίκλεια	Αμφίκλεια
2235	Καμένα Βούρλα	Καμένα Βούρλα
2236	Σπερχειάδα	Σπερχειάδα
2237	Καρπενήσι	Καλύπτει ολόκληρο τον Νομό Ευρυτανίας
2238	Στυλίδα	Στυλίδα
224x	Δωδεκάνησα	
2241	Ρόδος	Ρόδος
2242	Κως	Καλύπτει τα νησιά Κως & Νίσυρος
2243	Πόθια	Καλύπτει τα νησιά Κάλυμνος & Αστυπάλαια
2244	Αρχάγγελος	Αρχάγγελος
2245	Πηγάδια	Καλύπτει τα νησιά Κάρπαθος & Κάσος
2246	Σάλακος	Καλύπτει τα νησιά Καστελόριζο, Σύμη, Τήλος, Τμήματα Ρόδου & Χάλκη
2247	Αγία Μαρίνα	Καλύπτει τα νησιά Αγαθονήσι, Λέρος, Λειψοί & Πάτμος
225x	Λέσβος	
2251	Μυτιλήνη	Μυτιλήνη
2252	Αγιάσος	Αγιάσος
2253	Καλλονή	Καλλονή
2254	Μύρινα	Καλύπτει τα νησιά Άγιος Ευστράτιος & Λήμνος
226x	Τμήμα Αττικής, Βοιωτία & Φωκίδα	
2261	Λιβαδειά	Λιβαδειά
2262	Θήβα	Θήβα
2263	Δερβενοχώρια & Βίλια	
2264	Θίσβη	
2265	Άμφισσα	
2266	Λιδωρίκι	
2267	Αράχωβα	
2268	Αλίαρτος	
227x	Σάμος & Χίος	
2271	Χίος	
2272	Καρδάμυλα	
2273	Βαθύ	
2274	Βολισσός & Ψαρά	
2275	Άγιος Κήρυκος	Καλύπτει τα νησιά Ικαρία & Φούρνοι
228x	Κυκλάδες	
2281	Ερμούπολη	Καλύπτει τα νησιά Σύρος, Κύθνος & Σέριφος
2282	Άνδρος	
2283	Τήνος	
2284	Παροικιά	Καλύπτει τα νησιά Πάρος & Σίφνος
2285	Νάξος	Καλύπτει τα νησιά Αμοργός & Νάξος
2286	Φηρά Θήρας	Καλύπτει τα νησιά Ανάφη, Ίος, Σαντορίνη, Σίκινος & Φολέγανδρος
2287	Μήλος & Κίμωλος	
2288	Κέα	
2289	Μύκονος	
229x	Αττική	
2291	Λαγονήσι	
2292	Λαύριο	
2293	Άγιος Σωτήρας	
2294	Αρτέμιδα, Ραφήνα & Μαραθώνας	
2295	Αφίδνες	
2296	Μέγαρα	Καλύπτει επίσης τη Νέα Πέραμο & τις συνοικίες της
2297	Αίγινα	
2298	Τροιζήνα	Καλύπτει τα νησιά Πόρος, Σπέτσες, Τροιζηνία & Ύδρα
2299	Μαρκόπουλο	
Ζώνη 23 – Περιοχή Κεντρικής Μακεδονίας
Ο κωδικός 231 (0-9) x xxxxx - (το πέμπτο ψηφίο αλλάζει ανά περιοχή) καλύπτει αποκλειστικά και μόνο περιοχές της πόλης της Θεσσαλονίκης (Καλύπτει τις εξής περιοχές: Κέντρο Θεσσαλονίκης, Τριανδρία, Καλαμαριά, Συκιές, Άγιος Παύλος, Νεάπολη, Πεύκα, Σταυρούπολη, Νέα Ευκαρπία, Πολίχνη, Εύοσμος, Ελευθέριο - Κορδελιό, Αμπελόκηποι, Μενεμένη, Πανόραμα, Πυλαία, Χορτιάτης, Ασβεστοχώρι, Εξοχή, Σίνδος, Χαλάστρα, Θέρμη & Ωραιόκαστρο). Ο ακόλουθος πίνακας περιλαμβάνει ενδεικτικά τα προθέματα, που χρησιμοποιήθηκαν για τις επιμέρους περιοχές της μητροπολιτικής περιοχής της Θεσσαλονίκης.
Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Περιοχές που καλύπτει ο κωδικός
231	Θεσσαλονίκη & Περίχωρα	Περιοχές (ενδεικτικά)
2310 2	Θεσσαλονίκη Κέντρο	
2310 3	Χαριλάου	
2310 4	Καλαμαριά	
2310 5	Βαρδάρι	
2310 6	Νεάπολη	
2310 7	Έυοσμος	
2310 8	Αγία Τριάδα	
2310 9	Τούμπα	
232x	Σέρρες	Περιοχές (ενδεικτικά)
2321	Σέρρες	Σέρρες
2322	Νιγρίτα	Νιγρίτα
2323	Σιδηρόκαστρο	Σιδηρόκαστρο
2324	Νέα Ζίχνη	Νέα Ζίχνη, Ροδολίβος
2325	Ηράκλεια	Ηράκλεια
2327	Ροδόπολη	Ροδόπολη
233x	Ημαθία	Περιοχές (ενδεικτικά)
2331	Βέροια	Βέροια, Αγία Βαρβάρα, Αγία Τριάδα, Άγιος Γεώργιος, Αγκαθιά, Βεργίνα, Γεωργιανοί, Καστανιά, Κάτω Βέρμιο, Κουλούρα, Μακροχώρι, Μεγάλη Γέφυρα, Μελίκη, Νέα Νικομήδεια, Πολύδενδρο, Ριζώματα, Σταυρός, Συκιά, Τρίλοφο
2332	Νάουσα	Νάουσα, Γιαννακοχώρι, Ειρηνούπολη, Επισκοπή, Κοπανός, Λευκάδια, Μαρίνα, Ροδοχώρι, Στενήμαχος, Χαρίεσσα
2333	Αλεξάνδρεια	Αλεξάνδρεια, Καμποχώρι, Κορυφή, Λουτρός, Νησί, Νησέλι, Πλάτανος, Πλατύ, Τρίκαλα
234x	Κιλκίς	Περιοχές (ενδεικτικά)
2341	Κιλκίς	Κιλκίς, Ακροποταμιά, Βάθη, Βαφιοχώρι, Δροσάτο, Ευκαρπία, Κεντρικό, Κορωνούδα, Μάνδρες, Μαυρονέρι, Μεγάλη Βρύση, Μελισσουργειό, Μεσιανό, Μικρόκαμπος, Νέα Σάντα, Νέο Αγιονέρι, Νέο Γυναικόκαστρο, Πεδινό, Πλαγιά, Σταθμός Μουριών, Τέρπυλλος, Χέρσο, Χωρύγι
2343	Πολύκαστρο	Πολύκαστρο, Αξιούπολη, Άσπρος, Γουμένισσα, Εύζωνοι, Ευρωπός, Πλάγια, Ποντοηράκλεια, Ρύζια, Σιταριά
235x	Πιερία	Περιοχές (ενδεικτικά)
2351	Κατερίνη	Κατερίνη, Άγιος Δημήτριος, Βροντού, Γανόχωρα, Έλαφος, Κάτω Άγιος Ιωάννης, Κάτω Μηλιά, Καρίτσα, Κορινός, Κίτρος, Λαγόρραχη, Λόφος, Νέα Έφεσος, Παλαιόστανη, Παραλία Κατερίνης, Ρητίνη, Σφενδάμι, Τρίλοφος
2352	Λιτόχωρο	Λιτόχωρο, Λεπτοκαρυά, Λιμένας Λιτοχώρου, Πλάκα Λιτοχώρου, Πλαταμώνας, Σκοτίνα
2353	Αιγίνιο	Αιγίνιο, Κολινδρός, Μακρύγιαλος, Μεθώνη
237x	Χαλκιδική	Περιοχές (ενδεικτικά)
2371	Πολύγυρος	Πολύγυρος, Άγιος Πρόδρομος, Βάβδος, Βατοπέδι, Βράσταμα, Γαλάτιστα, Γερακινή, Δουμπιά, Κρήμνη, Ορμύλια, Ριζά, Ταξιάρχης
2372	Αρναία	Αρναία, Βαρβάρα, Μεγάλη Παναγία, Παλαιοχώρι, Στανός
2373	Νέα Μουδανιά	Νέα Μουδανιά, Άγιος Μάμας, Ελαιοχώρια, Νέα Πλάγια, Νέα Ποτίδαια, Νέα Τρίγλια, Σήμαντρα, Σωζόπολη
2374	Κασσάνδρεια	Κασσάνδρεια, Άφυτος, Καλάνδρα, Νέα Σκιώνη, Νέα Φώκαια, Παλιούρι, Πευκοχώρι, Πολύχρονο, Σανή
2375	Νικήτη	Νικήτη, Άγιος Νικόλαος, Βουρβουρού, Μεταγκίτσι, Μεταμόρφωση, Νέος Μαρμαράς, Πλανά, Πυργαδίκια, Σάρτη, Συκιά, Τορώνη
2376	Στρατώνι	Στρατώνι, Ολυμπιάδα, Στρατονίκη
2377	Ιερισσός & Άγιο Όρος	Ιερισσός, Άγιο Όρος, Αμμουλιανή, Δάφνη, Καρυές, Νέα Ρόδα, Ουρανούπολη
238x	Πέλλα & Φλώρινα	Περιοχές (ενδεικτικά)
2381	Έδεσσα	Έδεσσα, Άγιος Αθανάσιος, Αγία Φωτεινή, Άγρας, Άρνισσα, Βρυτά, Δροσερό, Καλλίπολη, Καλύβια, Καρυδιά, Λάκκα, Μάνδαλο, Παναγίτσα, Περαία, Πετραία, Προφήτης Ηλίας, Ριζάρι, Σεβαστιανά, Σκύδρα, Σωτήρα, Φλαμουριά
2382	Γιαννιτσά	Γιαννιτσά, Αγροσυκιά, Αραβησσός, Ελευθεροχώρι, Εσώβαλτα, Καρυώτισσα, Κρύα Βρύση, Νέα Πέλλα, Νέος Μυλότοπος, Μελίσσι, Πέλλα
2384	Αριδαία	Αριδαία, Άψαλος, Βορεινό, Γαρέφειο, Εξαπλάτανος, Θεοδωράκι, Κωνσταντία, Κρανέα, Λουτράκι, Λουτρά Λουτρακίου, Μεγαπλάτανος, Ξιφιανή, Περίκλεια, Πολυκάρπι, Προμάχοι, Τσάκοι, Φούστανη
2385	Φλώρινα	Φλώρινα, Άγιος Γερμανός Πρεσπών, Άγιος Αχίλλειος Πρεσπών, Αχλάδα, Αρμενοχώρι, Βεύη, Κρυσταλλοπηγή, Λαιμός, Μελίτη, Νίκη, Νέος Καύκασος, Παπαγιάννης, Πέρασμα, Πισοδέρι, Τριανταφυλλιά, Ψαράδες
2386	Αμύνταιο	Αμύνταιο, Άγιος Παντελεήμονας, Αετός, Κέλλη, Λέχοβο, Νυμφαίο, Ξινό Νερό, Πεδινό, Πέτρες
239x	Θεσσαλονίκη & Τμήμα Νομού Χαλκιδικής	Περιοχές (ενδεικτικά)
2391	Χαλκηδόνα	Χαλκηδόνα, Άθυρα, Άδενδρο, Κουφάλια, Ραχώνα
2392	Περαία	Περαία, Νέα Μηχανιώνα, Νέοι Επιβάτες
2393	Λαγκαδίκια	Λαγκαδίκια, Αρδαμέρι, Ζαγκλιβέρι
2394	Λαγκαδάς	Λαγκαδάς, Λαγυνά
2395	Σοχός	Σοχός
2396	Βασιλικά	Βασιλικά
2397	Ασπροβάλτα	Ασπροβάλτα, Βρασνά, Νέα Μάδυτος, Ρεντίνα, Σταυρός
2399	Νέα Καλλικράτεια	Νέα Καλλικράτεια, Άγιος Παύλος
Ζώνη 24 – Περιοχή Δυτικής Μακεδονίας & Θεσσαλίας
Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Περιοχές (ενδεικτικά)
241	Λάρισα & Περίχωρα	
241 (0-7) xxxxxx	Λάρισα	Λάρισα, Γιάννουλη, Κιλελέρ, Κοιλάδα
242x	Μαγνησία	
2421	Βόλος	
2422	Αλμυρός	
2423	Αργαλαστή	
2424	Αλόννησος & Σκόπελος	
2425	Βελεστίνο	
2426	Ζαγορά	
2427	Σκιάθος	
2428	Κεραμίδι	
243x	Τρίκαλα	
2431	Τρίκαλα	
2432	Καλαμπάκα	
2433	Φαρκαδόνα	
2434	Πύλη	
244x	Καρδίτσα	
2441	Καρδίτσα	
2443	Σοφάδες	
2444	Παλαμάς	
2445	Μουζάκι	
246x	Δυτική Μακεδονία	
2461	Κοζάνη	Κοζάνη, Άγιος Δημήτριος, Αλωνάκια, Αιανή, Κρόκος, Κοιλάδα, Μαυροδένδρι, Πολύμυλος
2462	Γρεβενά	Καλύπτει ολόκληρο τον Νομό Γρεβενών
2463	Πτολεμαΐδα	Πτολεμαΐδα, Ανατολικό, Αντίγονος, Άρδασσα, Βλάστη, Ερμακιά, Λιμνοχώρι, Πύργοι, Φαράγγι, Φιλώτας, Φούφας
2464	Σέρβια	Σέρβια, Βελβεντό, Λάβα, Νεράϊδα, Πλατανόρρεμα
2465	Σιάτιστα	Σιάτιστα
2467	Καστοριά	Καλύπτει ολόκληρο τον Νομό Καστοριάς
2468	Νεάπολη	Νεάπολη, Πεντάλοφος, Τσοτύλι
249x	Λάρισα	
2491	Φάρσαλα	
2492	Τύρναβος	
2493	Ελασσόνα	Ελασσόνα, Κρανέα, Σαραντάπορο
2494	Αγιά	
2495	Μακρυχώρι	Μακρυχώρι, Γόννοι, Τέμπη
Ζώνη 25 – Περιοχή Ανατολικής Μακεδονίας & Θράκης
Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Περιοχές (ενδεικτικά)
251	Καβάλα & Περίχωρα	
251 xxxxxxx	Καβάλα	
252x	Νομός Δράμας	
2521	Δράμα	
2522	Προσοτσάνη	
2523	Νευροκόπι	
2524	Παρανέστι	
253x	Νομός Ροδόπης	
2531	Κομοτηνή	
2532	Σάπες	
2533	Ξυλαγανή	
2534	Ίασμος	
2535	Νέα Καλλίστη	
254x	Νομός Ξάνθης	
2541	Ξάνθη	
2542	Σταυρούπολη	
2544	Μύκη	
255x	Νομός Έβρου	
2551	Αλεξανδρούπολη & Σαμοθράκη	
2552	Ορεστιάδα	
2553	Διδυμότειχο	
2554	Σουφλί	
2555	Φέρες	
2556	Κυπρίνος	
259x	Νομός Καβάλας	
2591	Χρυσούπολη	
2592	Ελευθερούπολη	
2593	Θάσος	
2594	Νέα Πέραμος	Νέα Πέραμος, Κάριανη
Ζώνη 26 – Περιοχή Δυτικής Ελλάδας, Ηπείρου & Ιονίων Νήσων
Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Περιοχές (ενδεικτικά)
261	Πάτρα & Περίχωρα	
261 xxxxxxx	Πάτρα	Πάτρα, Ρίο
262x	Νομός Ηλείας	
2621	Πύργος	
2622	Αμαλιάδα	
2623	Λεχαινά	
2624	Αρχαία Ολυμπία	
2625	Κρέστενα	
2626	Ανδρίτσαινα	
263x	Νομός Αιτωλοακαρνανίας	
2631	Μεσολόγγι	
2632	Αιτωλικό	
2634	Ναύπακτος	
2635	Παππαδάτες	
264x	Νομός Αιτωλοακαρνανίας & Νομός Λευκάδας	
2641	Αγρίνιο	
2642	Αμφιλοχία	
2643	Βόνιτσα	
2644	Θέρμο	
2645	Λευκάδα	Καλύπτει ολόκληρο το νησί της Λευκάδας
2646	Αστακός	Καλύπτει και τα νησιά Κάλαμος & Καστός Λευκάδας
2647	Νέο Χαλκιόπουλο	
265x	Νομός Ιωαννίνων	
2651	Ιωάννινα	Ιωάννινα, Ανατολή, Κατσικάς
2653	Ζαγοροχώρια	
2654	Πέρδικα	
2655	Κόνιτσα	
2656	Μέτσοβο	Μέτσοβο, Ανήλιο, Μηλιά
2657	Δελβινάκι	
2658	Ζίτσα	
2659	Κατσανοχώρια	
266x	Νομός Θεσπρωτίας & Νομός Κέρκυρας	
2661	Κέρκυρα	Καλύπτει το κεντρικό κομμάτι της Κέρκυρας
2662	Λευκίμμη	Καλύπτει το νότιο κομμάτι της Κέρκυρας και τους Παξούς
2663	Παλαιοκαστρίτσα	Καλύπτει το βόρειο κομμάτι της Κέρκυρας και τους Διαπόντιους νήσους
2664	Φιλιάτες	Φιλιάτες, Σαγιάδα
2665	Ηγουμενίτσα	Ηγουμενίτσα, Καλοδίκι, Μαργαρίτι, Σύβοτα
2666	Παραμυθιά	
267x	Νομός Κεφαλληνίας	
2671	Αργοστόλι	Καλύπτει το δυτικό και κεντρικό κομμάτι της Κεφαλλονιάς
2674	Σάμη	Καλύπτει το ανατολικό κομμάτι της Κεφαλλονιάς και το νησί της Ιθάκης
268x	Νομός Άρτας & Νομός Πρέβεζας	
2681	Άρτα	Άρτα, Πέτα
2682	Πρέβεζα	
2683	Φιλιππιάδα	Φιλιππιάδα, Αμμότοπος
2684	Καναλλάκι	Καναλλάκι, Πάργα
2685	Βουργαρέλι	
269x	Νομός Αχαΐας & Νομός Ζακύνθου	
2691	Αίγιο	Αίγιο, Λαμπίρι
2692	Καλάβρυτα	
2693	Κάτω Αχαΐα	
2694	Χαλανδρίτσα	
2695	Ζάκυνθος	Καλύπτει ολόκληρο τον Νομό Ζακύνθου
2696	Ακράτα	
Ζώνη 27 – Περιοχή Πελοποννήσου
Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Περιοχές (ενδεικτικά)
271	Τρίπολη & Περίχωρα	
271 xxxxxxx	Τρίπολη	
272x	Νομός Μεσσηνίας	
2721	Καλαμάτα	
2722	Μεσσήνη	
2723	Πύλος	
2724	Μελιγαλάς	
2725	Κορώνη	
273x	Νομός Λακωνίας & Κύθηρα	
2731	Σπάρτη	
2732	Μονεμβασιά	
2733	Γύθειο	
2734	Νεάπολη	
2735	Σκάλα	
2736	Κύθηρα	
274x	Νομός Κορινθίας	
2741	Κόρινθος	
2742	Κιάτο	
2743	Ξυλόκαστρο	
2744	Λουτράκι	
2746	Νεμέα	
2747	Καλιάνοι	
275x	Νομός Αργολίδας & Νομός Αρκαδίας (Κυνουρία)	
2751	Άργος	
2752	Ναύπλιο	
2753	Λυγουριό	
2754	Κρανίδι	
2755	Άστρος	
2757	Λεωνίδιο	
276x	Νομός Μεσσηνίας (Τριφυλία)	
2761	Κυπαρισσία	
2763	Γαργαλιάνοι	
2765	Κοπανάκι	
279x	Νομός Αρκαδίας	
2791	Μεγαλόπολη	
2792	Καστρί Κυνουρίας	
2795	Βυτίνα	
2796	Λεβίδι	
2797	Τρόπαια	
Ζώνη 28 – Περιοχή Κρήτης
Πρόθεμα ευρύτερης περιοχής	Ευρύτερη γεωγραφική περιοχή	Περιοχές (ενδεικτικά)
281	Ηράκλειο & Περίχωρα	
281 xxxxxxx	Ηράκλειο	
282x	Νομός Χανίων	
2821	Χανιά	
2822	Κίσσαμος	
2823	Κάντανος	
2824	Κολυμβάρι	
2825	Βάμος	
283x	Νομός Ρεθύμνης	
2831	Ρέθυμνο	
2832	Σπήλι	
2833	Αμάρι	
2834	Πέραμα Μυλοποτάμου	
284x	Νομός Λασιθίου	
2841	Άγιος Νικόλαος	
2842	Ιεράπετρα	
2843	Σητεία	
2844	Τζερμιάδο	
289x	Νομός Ηρακλείου	
2891	Αρκαλοχώρι	
2892	Μοίρες	
2893	Πύργος	
2894	Αγία Βαρβάρα	
2895	Άνω Βιάννος
2897	Λιμένας Χερσονήσου
"""

lst = []

for f in file.split('\n'):
    f = f.split('\t')
    while '' in f:
        f.remove('')
    if f:
        lst.append(f)

a = input('Enter a phone number: ')


def get_dialing_code(home_phone_number):
    lst1 = []
    lst2 = []
    lst3 = []
    lst4 = []

    for l in lst:
        if l[0].startswith(home_phone_number[:2]):
            lst1.append(l)
        if l[0].startswith(home_phone_number[:3]):
            lst2.append(l)
        if l[0].startswith(home_phone_number[:4]):
            lst3.append(l)
        if l[0].startswith(home_phone_number[:5]):
            lst4.append(l)

    lsts = [lst4, lst3, lst2, lst1]

    for tsl in lsts:
        if tsl:
            return tsl


print(get_dialing_code(a))
